paddy2008/c51_uboot/src/Efm8lb12_qsfp28.c
#include "Efm8lb12_qsfp28.h"
#include "Efm8lb12_cmd.h"
#include "mcu_sal.h"


static uint8_t _mod_type 	 = INVALID;
static uint8_t _mod_sub_type = INVALID;
static uint8_t _mod_hw_rev   = INVALID;

static POLL_T poll = {0};

static MSA_PAGE_LOWER_MON_T _lower_mon = {0};

const uint8_t lut_page_select[MSA_LUT_TYPE_MAX] = {SFP_PAGE_06H, SFP_PAGE_06H, SFP_PAGE_07H};
const uint8_t lut_temp_select[MSA_LUT_TYPE_MAX] = {LUT_LT_TEMP_MSB, LUT_MT_TEMP_MSB, LUT_HT_TEMP_MSB};

uint8_t smb_write_page_byte(uint8_t BaseAddr, uint8_t page, uint16_t OffsetAddr,uint8_t *Data, uint16_t Length)
{
	uint8_t ret = RET_FAILED;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, page);
	JUDGE_RETURN(ret);
	ret = i2c_master_write(BaseAddr, OffsetAddr, Data, Length);
	return ret;
}

uint8_t smb_read_page_byte(uint8_t BaseAddr, uint8_t page, uint16_t OffsetAddr,uint8_t *Data, uint16_t Length)
{
	uint8_t ret = RET_FAILED;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, page);
	JUDGE_RETURN(ret);
	ret = i2c_master_read(BaseAddr, OffsetAddr, Data, Length);
	return ret;
}


const uint8_t lut_laser_cfg_select[MSA_LUT_TYPE_MAX][CHANNEL_MAX] =
{
	{PAGE6_LT_CH0_LASER_CFG_BASE_ADDR, PAGE6_LT_CH1_LASER_CFG_BASE_ADDR, PAGE6_LT_CH2_LASER_CFG_BASE_ADDR, PAGE6_LT_CH3_LASER_CFG_BASE_ADDR},
	{PAGE6_MT_CH0_LASER_CFG_BASE_ADDR, PAGE6_MT_CH1_LASER_CFG_BASE_ADDR, PAGE6_MT_CH2_LASER_CFG_BASE_ADDR, PAGE6_MT_CH3_LASER_CFG_BASE_ADDR},
	{PAGE7_HT_CH0_LASER_CFG_BASE_ADDR, PAGE7_HT_CH1_LASER_CFG_BASE_ADDR, PAGE7_HT_CH2_LASER_CFG_BASE_ADDR, PAGE7_HT_CH3_LASER_CFG_BASE_ADDR}
};

const uint8_t page3_alarm_wran_select[] =
{
	PAGE3_TEMP_HIGH_ALARM_MSB  , PAGE3_TEMP_LOW_ALARM_MSB  , PAGE3_TEMP_HIGH_WARN_MSB  , PAGE3_TEMP_LOW_WARN_MSB ,
	PAGE3_VCC_HIGH_ALARM_MSB   , PAGE3_VCC_LOW_ALARM_MSB   , PAGE3_VCC_HIGH_WARN_MSB   , PAGE3_VCC_LOW_WARN_MSB   ,
	PAGE3_RXPWR_HIGH_ALARM_MSB , PAGE3_RXPWR_LOW_ALARM_MSB , PAGE3_RXPWR_HIGH_WARN_MSB , PAGE3_RXPWR_LOW_WARN_MSB ,
	PAGE3_TXBIAS_HIGH_ALARM_MSB, PAGE3_TXBIAS_LOW_ALARM_MSB, PAGE3_TXBIAS_HIGH_WARN_MSB, PAGE3_TXBIAS_LOW_WARN_MSB,
	PAGE3_TXPWR_HIGH_ALARM_MSB , PAGE3_TXPWR_LOW_ALARM_MSB , PAGE3_TXPWR_HIGH_WARN_MSB , PAGE3_TXPWR_LOW_WARN_MSB
};

uint8_t _qsfp28_get_channel(const char  *s)
{
	uint8_t channel = -1;

	if (!strcmp(s, "ch0"))
	{
		channel = CHANNEL0;
	}
	else if (!strcmp(s, "ch1"))
	{
		channel = CHANNEL1;
	}
	else if (!strcmp(s, "ch2"))
	{
		channel = CHANNEL2;
	}
	else if (!strcmp(s, "ch3"))
	{
		channel = CHANNEL3;
	}
	else if (!strcmp(s, "all"))
	{
		channel = CHANNEL_MAX;
	}
	else
	{
		channel = RET_FAILED;
		uart_printf("\r\nchannedl%bu is not support\r\n",channel);
	}
	return channel;
}

static uint16_t _com_int_pow(uint8_t m, uint8_t n)
{
	uint8_t i = 0;
	uint16_t result = 1;

	for ( i = 0; i < n; i++)
	{
		result *= m;
	}
	return result;
}

int16_t com_str_to_int16(uint8_t *str)
{
	idata uint8_t  *ptr = str, i = 0, len = 0, tmp[5];
	idata int16_t  temp = 0;
	bool IsHex = false;

	memset(tmp,'\0',5);

	if ((strchr(str,'x') != NULL) || (strchr(str,'X') != NULL))
	{
		IsHex = true;
		ptr += 2;
		for (i = 0; i < 4 ; i++)
		{
			tmp[i] = *ptr;
			ptr++;
		}
		ptr = tmp;
	}
	else
	{
		ptr = str;
	}

	if (IsHex)
	{
		len = strlen(ptr);
		for (i = 0; i < len; i++)
		{
			if (*ptr >= '0' && *ptr <= '9')
			{
				temp += (*ptr-'0') * _com_int_pow(16,len-1-i);
			}
			else if (*ptr >= 'a' && *ptr <= 'f')
			{
				temp += (*ptr-'a'+ 10) * _com_int_pow(16,len-1-i);
			}
			else if (*ptr >= 'A' && *ptr <= 'F')
			{
				temp += (*ptr-'A' + 10) * _com_int_pow(16,len-1-i);
			}
			ptr++;
		}
	}
	else
	{
		temp = (int16_t)atoi(ptr);
	}

	return temp;
}

void com_delay(uint16_t sec)
{
	timer_delay_ms(sec);
}

void com_delay_us(uint8_t us)   //excute one time is 72 clock cycles
{
	uint8_t i = 0;

	for(i = 0; i < us; i++)
	{
		_nop_();

		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();

		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();

		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();

		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();

		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();


		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
		_nop_();
	}
}

bool com_get_module_boot_status()
{
	uint8_t value = 1, i = 0;

	for(i = 0; i < 20; i++)
	{
		value = 1;
		if(RET_OK == i2c_master_read_byte(I2C_DEVICE_ADDR, MSA_BOOT_STATUS, &value))
		{
			if(MY_GET_BIT(value, 0) != 0x0) //equal to 0 indicate the module boot success
			{
				break;
			}
		}
	}

	if(i == 20)
	{
		return true;
	}

	return false;
}

bool com_test_board_pre_handle()
{
	if(com_get_module_boot_status())
	{
		uart_printf("%s","\r\nModule boot success");
		uart_printf("%s","\r\n#McuTestBoard:");
		return true;
	}
	else
	{
		uart_printf("%s","\r\nModule boot error");
		return false;
	}

}

uint16_t com_average_value16(uint16_t *buffer, uint8_t length)
{
	uint8_t  i  = 0;
	uint16_t max = 0, min = 0;
	uint32_t sum = 0;

	max = buffer[0];
	min = buffer[0];

	for(i = 0; i < length; i++)
	{
		if(buffer[i] > max)
		{
			max = buffer[i];
		}

		if(buffer[i] < min)
		{
			min = buffer[i];
		}
		sum += buffer[i];
	}

	sum = sum - min - max;

	return (uint16_t)(sum / (length -2));
}




bool qsfp28_get_cmd_status()
{
	uint8_t  cmd_ret_status = 0;
	uint16_t counter = 0;

	do
	{
		i2c_master_read_byte(I2C_DEVICE_ADDR, SFP_DBG_CMD, &cmd_ret_status);
		counter ++;
		timer_delay_ms(2 * counter);
		if(counter >= 100)  //delay 10s
		{
			uart_printf("\r\nQsfp28_get_cmd_status failed");
			return false;
		}

	}while(cmd_ret_status != RET_OK && cmd_ret_status != RET_FAILED);

	i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_CMD, SFP_DBG_CMD_IDLE);  //set dbg_cmd_status idle

	if(cmd_ret_status == RET_FAILED)
	{
		return false;
	}
	else
	{
		return true;
	}
}

static char * qsfp28_get_mod_name(char *name)
{
	switch(_mod_type) {
		case MODULE_TYPE_SR4:
			sprintf(name, "SR4-%bx%02bx", _mod_type, _mod_sub_type);
			break;
		case MODULE_TYPE_CWDM4:
			sprintf(name, "CWDM4-%bx%02bx", _mod_type, _mod_sub_type);
			break;
		case MODULE_TYPE_LR4:
			sprintf(name, "LR4-%bx%02bx", _mod_type, _mod_sub_type);
			break;
		default:
			sprintf(name, "UNKNOWN");
			break;
	}
	return name;
}

uint8_t qsfp28_common_rssi_show()
{
	uint16_t rssi_ua[4];

