paddy2008/c51_uboot/src/Efm8lb12_qsfp28.c
	uint8_t rssi_addr[] = {0x86, 0x92, 0x9E, 0xAA} ,channel = 0 , ret = RET_OK;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);

	for(channel = 0; channel < CHANNEL_MAX; channel++)
	{
		ret = i2c_master_read(I2C_DEVICE_ADDR, rssi_addr[channel], (uint8_t *)&rssi_ua[channel], 2);
	}
	uart_printf( "\r\nRssi_ua %-5hu %-5hu %-5hu %-5hu", rssi_ua[0],rssi_ua[1],rssi_ua[2],rssi_ua[3]);

	return ret;
}

uint32_t qsfp28_get_mod_soft_type()
{
	uint32_t ret = RET_OK;
	static uint16_t num = 0;

	_mod_type 	  = INVALID;
	_mod_sub_type = INVALID;
	_mod_hw_rev   = INVALID;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_05H);
	JUDGE_RETURN(ret);

	i2c_master_read_byte(I2C_DEVICE_ADDR, MSA_OFF_MODULE_TYPE, &_mod_type);
	i2c_master_read_byte(I2C_DEVICE_ADDR, MSA_OFF_MODULE_SUB_TYPE, &_mod_sub_type);
	i2c_master_read_byte(I2C_DEVICE_ADDR, MSA_OFF_HW_VER, &_mod_hw_rev);

	ret =  (uint32_t)_mod_type << 16 | (uint32_t)_mod_sub_type << 8 | _mod_hw_rev;

	/*
	switch(((uint32_t)_mod_type << 8)|((uint32_t)_mod_sub_type))
	{
		case 0x101:
			AOC_101_cmd_init();
			break;
		case 0x206:
			CWDM4_206_cmd_init();
			break;
		case 0x301:
			LR4_301_cmd_init();
			break;
		case 0x207:
			CWDM4_207_cmd_init();
			break;
		case 0x211:
			CWDM4_211_cmd_init();
			break;
		default:
			break;
	}
	*/
	terminal_register_cmd(NULL,NULL);
	return ret;
}

uint8_t qsfp28_get_mod_type()
{
	return _mod_type;
}

uint8_t qsfp28_get_mod_release_info()
{
	uint8_t ret = RET_OK;
	char mod_name[32] = {0};
	MODULE_REALEASE_INFO  mod_realea_info;

	qsfp28_get_mod_soft_type();
	qsfp28_get_mod_name(mod_name);

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);

	ret = i2c_master_read(I2C_DEVICE_ADDR, SFP_MOD_REA_SEC, (uint8_t *)&mod_realea_info, sizeof(mod_realea_info));

	if(strcmp(mod_name, "UNKNOWN"))
	{
		uart_printf("\r\n%s-AM%bu_v%bu.%bu	20%bu.%bu.%bu-%bu:%bu",
		mod_name, _mod_hw_rev,
		mod_realea_info.ver_num_msb, mod_realea_info.ver_num_lsb,
		mod_realea_info.year, mod_realea_info.mon, mod_realea_info.day,
		mod_realea_info.hour, mod_realea_info.min);
	}
	else
	{
		ret = RET_FAILED;
	}
	return ret;
}

uint8_t qsfp28_get_msa_lower_page_monitor()
{
	return i2c_master_read(I2C_DEVICE_ADDR, MSA_PAGE_LOWER_MON_BASE_ADDR, (uint8_t *)&_lower_mon, sizeof(MSA_PAGE_LOWER_MON_T));
}

static uint8_t qsfp28_get_ddmi_vcc(DDMI_CALI_TYPE type)
{
	uint8_t ret = RET_OK;

	if(type == DDMI_CALI_BEFORE)
	{
		uint16_t vcc;

		ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
		JUDGE_RETURN(ret);
		ret = i2c_master_read(I2C_DEVICE_ADDR, SFP_DDMI_VCC_MSB, (uint8_t *)&vcc, 2);		//uint:0.1mv
		JUDGE_RETURN(ret);
		uart_printf("\r\nDdmi_vcc:%f(v)",(float)vcc * 0.1 / 1000.0);
	}
	else if(type == DDMI_CALI_AFTER)
	{
		//_lower_mon.vcc uint:0.1mV
		uart_printf("\r\nDdmi_cali_vcc:%f(v)",(float)_lower_mon.vcc * 0.1 / 1000.0);  //uint:V
	}

	return ret;
}

static uint8_t qsfp28_get_ddmi_temp(DDMI_CALI_TYPE type)
{
	uint8_t ret = RET_OK;

	if(type == DDMI_CALI_BEFORE)
	{
		int16_t temp = 0;

		ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
		JUDGE_RETURN(ret);
		ret = i2c_master_read(I2C_DEVICE_ADDR, SFP_DDMI_TEMP_MSB, (uint8_t *)&temp, 2);
		JUDGE_RETURN(ret);
		uart_printf("\r\nDdmi_temp:%f(C)", (float)temp/(float)DDMI_CALI_TEMP_SCALE);
	}
	else if(type == DDMI_CALI_AFTER)
	{
		//_lower_mon.temp uint:1/256 C
		uart_printf("\r\nDdmi_cali_temp:%f(C)",(float)_lower_mon.temp/(float)DDMI_CALI_TEMP_SCALE);  //uint:ÉãÊÏ¶È
	}

	return ret;
}

static uint8_t qsfp28_get_ddmi_bias(uint8_t channel, DDMI_CALI_TYPE type)
{
	uint8_t ret = RET_OK;

	if(channel >= CHANNEL_MAX)
	{
		uart_printf("\r\nchannedl%bu is not support\r\n",channel);
		ret = RET_FAILED;
	}

	if(type == DDMI_CALI_BEFORE)
	{
		uint16_t bias;
		uint8_t bias_addr[] = {0x84, 0x90, 0x9C, 0xA8};

		ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
		JUDGE_RETURN(ret);
		ret = i2c_master_read(I2C_DEVICE_ADDR, bias_addr[channel], (uint8_t *)&bias, 2);  //uint:0.1mA
		JUDGE_RETURN(ret);
		uart_printf("\r\nDdmi_bias%bu:%f(mA)",channel, (float)bias * 0.1);  //uint:mA
	}
	else if(type == DDMI_CALI_AFTER)
	{
		//_lower_mon.txbias[channel]  uint:2uA
		uart_printf("\r\nDdmi_cali_bias%bu:%f(mA)",channel, (float)_lower_mon.txbias[channel] * 2.0 / 1000.0);  //uint:mA
	}
	return ret;
}

static uint8_t qsfp28_get_ddmi_txmon(uint8_t channel, DDMI_CALI_TYPE type)
{
	uint8_t ret = RET_OK;

	if(channel >= CHANNEL_MAX)
	{
		uart_printf("\r\nchannedl%bu is not support\r\n",channel);
		ret = RET_FAILED;
	}

	if(type == DDMI_CALI_BEFORE)
	{
		uint16_t txmon;
		uint8_t  txmon_addr[] = {0x88, 0x94, 0xA0, 0xAC};

		ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
		JUDGE_RETURN(ret);
		ret = i2c_master_read(I2C_DEVICE_ADDR, txmon_addr[channel], (uint8_t *)&txmon, 2);  //uint:0.1mA
		if(qsfp28_get_mod_type() != MODULE_TYPE_SR4 )
		{
			uart_printf("\r\nDdmi_txmon%bu:%f(mV)",channel, (float)txmon * 0.1 );  //uint:mA
		}
		else 
		{
			uart_printf("\r\nDdmi_txmon%bu:%f(mA)",channel, (float)txmon * 0.1 );  //uint:mA
		}
	}
	else if(type == DDMI_CALI_AFTER)
	{
		//_lower_mon.txpower uint:0.1uW
		uart_printf("\r\nDdmi_cali_txpower%bu:%f(dbm)",channel, 10.0 *log10(((float)_lower_mon.txpower[channel] * 0.1 /1000.0)));
	}
	return ret;
}

static uint8_t qsfp28_get_ddmi_rssi(uint8_t channel,DDMI_CALI_TYPE type )
{
	uint8_t ret = RET_OK;

	if(channel >= CHANNEL_MAX)
	{
		uart_printf("\r\nchannedl%d is not support\r\n",channel);
		ret = RET_FAILED;
	}

	if(type == DDMI_CALI_BEFORE)
	{
		uint16_t rssi;
		uint8_t rssi_addr[] = {0x86, 0x92, 0x9E, 0xAA};

		ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
		JUDGE_RETURN(ret);
		ret = i2c_master_read(I2C_DEVICE_ADDR, rssi_addr[channel], (uint8_t *)&rssi, 2);  //uint:uA
		JUDGE_RETURN(ret);
		uart_printf("\r\nDdmi_rssi%bu:%hu(uA)",channel, rssi);
	}
	else if(type == DDMI_CALI_AFTER)
	{
		uart_printf("\r\nDdmi_cali_rxpower%bu:%f(dbm)",channel, 10 *log10(((float)_lower_mon.rssi[channel] * 0.1 /1000.0)));
	}
	return ret;
}

uint8_t qsfp28_get_ddmi(DDMI_DATA_TYPE ddmi_type, uint8_t channel, DDMI_CALI_TYPE type)
{
	uint8_t ret = RET_OK;

	switch(ddmi_type)
	{
		case DDMI_VCC:
		{
			ret = qsfp28_get_ddmi_vcc(type);
			break;
		}
		case DDMI_TEMP:
		{
			ret = qsfp28_get_ddmi_temp(type);
			break;
		}
		case DDMI_BIAS:
		{
			ret = qsfp28_get_ddmi_bias(channel, type);
			break;
		}
		case DDMI_TXMON:
		{
			ret = qsfp28_get_ddmi_txmon(channel, type);
			break;
		}
		case DDMI_RSSI:
		{
			ret = qsfp28_get_ddmi_rssi(channel, type);
			break;
		}
		default:
			break;
	}
	return ret;
}

