paddy2008/c51_uboot/src/Efm8lb12_qsfp28.c
uint8_t qsfp28_set_ddmi_cali_para(DDMI_DATA_TYPE ddmi_type, uint8_t channel, DDMI_CALI_PARA_T* cali_para)
{
	uint8_t ret = RET_OK;
	uint8_t page_select[] = {SFP_PAGE_06H, SFP_PAGE_07H, SFP_PAGE_07H, SFP_PAGE_07H};

	switch(ddmi_type)
	{
		case DDMI_VCC:
		{
			ret = smb_write_page_byte(I2C_DEVICE_ADDR, (uint8_t)SFP_PAGE_06H, PAGE6_DDMI_CALI_VCC_OFFSET_MSB, (uint8_t *)&cali_para->vcc, 2);
			break;
		}
		case DDMI_TEMP:
		{
			ret = smb_write_page_byte(I2C_DEVICE_ADDR, (uint8_t)SFP_PAGE_06H, PAGE6_DDMI_CALI_TEMP_OFFSET_MSB, (uint8_t *)&cali_para->temp, 2);
			break;
		}
		case DDMI_BIAS:
		{
			uint8_t bias_para_addr[] = {PAGE6_DDMI_CALI_CH0_BIAS_BASE_ADDR, PAGE7_DDMI_CALI_CH1_BIAS_BASE_ADDR, PAGE7_DDMI_CALI_CH2_BIAS_BASE_ADDR, PAGE7_DDMI_CALI_CH3_BIAS_BASE_ADDR};
			ret = smb_write_page_byte(I2C_DEVICE_ADDR, (uint8_t)page_select[channel], bias_para_addr[channel], (uint8_t *)&cali_para->current[channel].bias, sizeof(cali_para->current[0].bias));
			break;
		}
		case DDMI_TXMON:
		{
			uint8_t txpower_para_addr[] = {PAGE6_DDMI_CALI_CH0_TXPOWER_BASE_ADDR, PAGE7_DDMI_CALI_CH1_TXPOWER_BASE_ADDR, PAGE7_DDMI_CALI_CH2_TXPOWER_BASE_ADDR, PAGE7_DDMI_CALI_CH3_TXPOWER_BASE_ADDR};
			ret = smb_write_page_byte(I2C_DEVICE_ADDR, page_select[channel], txpower_para_addr[channel], (uint8_t *)&cali_para->current[channel].txpower, sizeof(cali_para->current[0].txpower));
			break;
		}
		case DDMI_RSSI:
		{
			uint8_t rxpower_para_addr[] = {PAGE6_DDMI_CALI_CH0_RXPOWER_BASE_ADDR, PAGE7_DDMI_CALI_CH1_RXPOWER_BASE_ADDR, PAGE7_DDMI_CALI_CH2_RXPOWER_BASE_ADDR, PAGE7_DDMI_CALI_CH3_RXPOWER_BASE_ADDR};
			ret = smb_write_page_byte(I2C_DEVICE_ADDR, page_select[channel], rxpower_para_addr[channel], (uint8_t *)&cali_para->current[channel].rxpower, sizeof(cali_para->current[0].rxpower));
			break;
		}
		default:
			break;
	}
	return ret;
}

uint8_t qsfp28_get_ddmi_cali_para(DDMI_DATA_TYPE ddmi_type, uint8_t channel, DDMI_CALI_PARA_T* cali_para)
{
	uint8_t ret = RET_OK;

	if(channel == 0x0 || ddmi_type == DDMI_VCC || ddmi_type == DDMI_TEMP)
	{
		ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_06H);
		JUDGE_RETURN(ret);
	}
	else
	{
		ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_07H);
		JUDGE_RETURN(ret);
	}

	switch(ddmi_type)
	{
		case DDMI_VCC:
		{
			ret = i2c_master_read(I2C_DEVICE_ADDR, PAGE6_DDMI_CALI_VCC_OFFSET_MSB, (uint8_t *)&cali_para->vcc, 2);
			break;
		}
		case DDMI_TEMP:
		{
			ret = i2c_master_read(I2C_DEVICE_ADDR, PAGE6_DDMI_CALI_TEMP_OFFSET_MSB, (uint8_t *)&cali_para->temp, 2);
			break;
		}
		case DDMI_BIAS:
		{
			uint8_t bias_para_addr[] = {PAGE6_DDMI_CALI_CH0_BIAS_BASE_ADDR, PAGE7_DDMI_CALI_CH1_BIAS_BASE_ADDR, PAGE7_DDMI_CALI_CH2_BIAS_BASE_ADDR, PAGE7_DDMI_CALI_CH3_BIAS_BASE_ADDR};
			ret = i2c_master_read(I2C_DEVICE_ADDR, bias_para_addr[channel], (uint8_t *)&cali_para->current[channel].bias, sizeof(cali_para->current[0].bias));
			break;
		}
		case DDMI_TXMON:
		{
			uint8_t txpower_para_addr[] = {PAGE6_DDMI_CALI_CH0_TXPOWER_BASE_ADDR, PAGE7_DDMI_CALI_CH1_TXPOWER_BASE_ADDR,PAGE7_DDMI_CALI_CH2_TXPOWER_BASE_ADDR, PAGE7_DDMI_CALI_CH3_TXPOWER_BASE_ADDR};
			ret = i2c_master_read(I2C_DEVICE_ADDR, txpower_para_addr[channel], (uint8_t *)&cali_para->current[channel].txpower, sizeof(cali_para->current[0].txpower));
			break;
		}
		case DDMI_RSSI:
		{
			uint8_t rxpower_para_addr[] = {PAGE6_DDMI_CALI_CH0_RXPOWER_BASE_ADDR, PAGE7_DDMI_CALI_CH1_RXPOWER_BASE_ADDR, PAGE7_DDMI_CALI_CH2_RXPOWER_BASE_ADDR, PAGE7_DDMI_CALI_CH3_RXPOWER_BASE_ADDR};
			ret = i2c_master_read(I2C_DEVICE_ADDR, rxpower_para_addr[channel], (uint8_t *)&cali_para->current[channel].rxpower, sizeof(cali_para->current[0].rxpower));
			break;
		}
		default:
			break;
	}

	return ret;
}

uint8_t qsfp28_set_lut_tab(uint8_t channel, MSA_LUT_TYPE type,  MSA_LASER_CH_CFG_T cfg)
{
	uint8_t ret = RET_OK;

	ret = smb_write_page_byte(I2C_DEVICE_ADDR, lut_page_select[type], lut_temp_select[type], (uint8_t *)&cfg.temp, 2);
	JUDGE_RETURN(ret);
	ret = smb_write_page_byte(I2C_DEVICE_ADDR, lut_page_select[type], lut_laser_cfg_select[type][channel], (uint8_t *)&cfg.bias, 6);
	return ret;
}

uint8_t qsfp28_get_lut_tab(uint8_t channel,LUT_SHOW_TYPE show_type, MSA_LUT_TYPE type)
{
	uint8_t *lt = "lt";
	uint8_t *mt = "mt";
	uint8_t *ht = "ht";
	uint8_t ret = RET_OK;
	MSA_LASER_CH_CFG_T laser_cfg;
	uint8_t *temp_type[MSA_LUT_TYPE_MAX] = {"lt","mt","ht"};

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, lut_page_select[type]);
	JUDGE_RETURN(ret);

	ret = i2c_master_read(I2C_DEVICE_ADDR, lut_temp_select[type], (uint8_t *)&laser_cfg.temp, 2);
	ret = i2c_master_read(I2C_DEVICE_ADDR, lut_laser_cfg_select[type][channel], (uint8_t *)&laser_cfg.bias, 6);

	if(show_type == PART_LUT_INFO)
	{
		uart_printf("\r\nch%bu-%s:temp     bias    mod     crossing", channel,temp_type[type]);
		uart_printf("\r\n\t%hd\t%hu\t%hu\t%hd",laser_cfg.temp/DDMI_CALI_TEMP_SCALE, laser_cfg.bias, laser_cfg.mod, laser_cfg.cross);
	}
	else
	{
		uart_printf("\r\nch%bu-%s\t%hd\t%hu\t%hu\t%hd",channel,temp_type[type],laser_cfg.temp/DDMI_CALI_TEMP_SCALE, laser_cfg.bias, laser_cfg.mod, laser_cfg.cross);
	}

	return ret;
}


uint8_t qsfp28_set_lut_tab_para_from_reg_inner(uint8_t channel, SAVE_CUR_LUT_TAB cur_lut)
{
	uint8_t ret = RET_OK;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);

	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_READ_DATA0, cur_lut);
	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_READ_DATA1, channel);
	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_CMD, DBG_SET_CUR_LUT_CMD);

	if(qsfp28_get_cmd_status() == false)
	{
		uart_printf("%s","\r\nSet lut tab now is failed");
		ret = RET_FAILED;
	}
	return ret;
}

uint8_t qsfp28_get_fixed_temp_point_apc_value(int8_t temp, uint8_t channel)
{
	MSA_LASER_CH_CFG_T cfg;
	uint8_t ret = RET_OK;

	cfg.temp = temp * DDMI_CALI_TEMP_SCALE; //because the module receive result is actual temp * 256

	if(channel == CHANNEL_MAX)
	{
		return RET_FAILED;
	}

	uart_printf("\r\n   ch%bu:temp     bias    mod     crossing", channel);

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);
	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_READ_DATA0, channel & 0xFF);
	ret = i2c_master_write(I2C_DEVICE_ADDR, SFP_DBG_READ_DATA2, (uint8_t *)&cfg.temp, 2);
	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_CMD, DBG_APC_CALI_CMD);

	if(qsfp28_get_cmd_status() == false)
	{
		uart_printf("%s","\r\nQsfp28_get_fixed_temp_point_apc_value failed");
		return RET_FAILED;
	}

