paddy2008/c51_uboot/src/Efm8lb12_qsfp28.c
	ret = i2c_master_read(I2C_DEVICE_ADDR, SFP_DBG_READ_DATA4, (uint8_t *)&cfg.bias, 2);
	ret = i2c_master_read(I2C_DEVICE_ADDR, SFP_DBG_READ_DATA6, (uint8_t *)&cfg.mod, 2);
	ret = i2c_master_read(I2C_DEVICE_ADDR, SFP_DBG_READ_DATA8, (uint8_t *)&cfg.cross, 2);
	uart_printf("\r\n\t%hd\t%hu\t%hu\t%hd",cfg.temp/DDMI_CALI_TEMP_SCALE, cfg.bias, cfg.mod, cfg.cross);

	return ret;
}


uint8_t  qsfp28_get_cur_apc_value(uint8_t channel)
{
	uint8_t ret = RET_OK;
	MSA_LASER_CH_CFG_T cfg;

	if(channel == CHANNEL_MAX)
	{
		return RET_FAILED;
	}

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);

	ret = i2c_master_read(I2C_DEVICE_ADDR, SFP_DDMI_TEMP_MSB, (uint8_t *)&cfg.temp, 2);
	ret = ((RET_FAILED == qsfp28_get_fixed_temp_point_apc_value(cfg.temp/DDMI_CALI_TEMP_SCALE, channel))? RET_FAILED : RET_OK);

	return ret;
}

static uint8_t qsfp28_read_log()
{
	uint8_t log[128];
	uint8_t i = 0, len = 0, ret = RET_OK;

	memset(log, '\0', sizeof(log));

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, MSA_PAGE_02H);
	JUDGE_RETURN(ret);

	ret = i2c_master_read(I2C_DEVICE_ADDR, SFP_DEBUG_LOG_START_ADDR, &log[0], 128);
	uart_printf("\r\nLog:%s",log);

	return ret;
}


uint8_t qsfp28_debug_log_handle(DEBUG_LOG_ACTION action)
{
	uint8_t ret = RET_OK;

	if(action == READ_LOG_CMD)
	{
		ret = qsfp28_read_log();
	}
	else if(action == DISABLE_LOG_CMD || action == ENABLE_LOG_CMD || action == CLEAR_LOG_CMD)
	{
		ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
		JUDGE_RETURN(ret);
		ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_READ_DATA0, action);
		ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_CMD, DBG_DEBUG_LOG_CMD);

		if(qsfp28_get_cmd_status() == false)
		{
			uart_printf("%s","\r\nQsfp28_debug_log_handle failed");
			ret = RET_FAILED;
		}
	}
	else
	{
		ret = RET_FAILED;
	}
	return ret;
}


static uint8_t qsfp28_eep_save(uint8_t dev_addr, uint16_t offset_addr, uint8_t value)
{
	uint8_t ret = RET_OK;
	SAVE_REG_T save_reg;

	save_reg.devAddr 	= dev_addr;
	save_reg.offsetAddr = offset_addr;
	save_reg.value 		= value;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);

	ret = i2c_master_write(I2C_DEVICE_ADDR, SFP_DBG_READ_DATA0, (uint8_t *)&save_reg, sizeof(SAVE_REG_T));
	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_CMD, DBG_SAVE_REG_TO_EEP_CMD);

	if(qsfp28_get_cmd_status() == false)
	{
		uart_printf("%s","\r\neep save failed");
		ret = RET_FAILED;
	}

	return ret;
}


static uint8_t qsfp28_eep_show()
{
	uint8_t eep_data_size = 0, i = 0, ret = RET_OK;
	SAVE_REG_T save_reg;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_05H);
	JUDGE_RETURN(ret);

	ret = i2c_master_read_byte(I2C_DEVICE_ADDR, EEP_DATA_SIZE, &eep_data_size);

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_0AH);
	JUDGE_RETURN(ret);

	uart_printf("\r\n\tDevAddr\t\tOffsetAddr\tValue");
	for (i = 0; i < (eep_data_size/4); i++)
	{
		ret = i2c_master_read(I2C_DEVICE_ADDR, PAGE10_START_ADDR + 4 * i, (uint8_t *)&save_reg, sizeof(SAVE_REG_T));
		uart_printf("\r\n\t0x%bx\t\t0x%hx\t\t0x%bx",save_reg.devAddr, save_reg.offsetAddr, save_reg.value);
		com_delay(10);
	}

	return ret;
}

uint8_t qsfp28_eep_handle(EEP_ACTION action, uint8_t dev_addr, uint16_t offset_addr, uint8_t value)
{
	uint8_t ret = RET_OK;

	switch(action)
	{
		case EEP_INIT:
		{
			ret = qsfp28_msa_page4_dbg_cmd(DBG_EEP_INIT_CMD);
			break;
		}
		case EEP_SAVE:
		{
			ret = qsfp28_eep_save(dev_addr, offset_addr, value);
			break;
		}
		case EEP_SHOW:
		{
			ret = qsfp28_eep_show();
			break;
		}
		case EEP_ERASE:
		{
			ret = qsfp28_msa_page4_dbg_cmd(DBG_EEP_ERASE_CMD);  //erase all eep info
			break;
		}
		default:
			break;
	}

	return ret;
}

uint8_t qsfp28_msa_page4_dbg_cmd(MSA_PAGE4_DBG_CMD_T cmd)
{
	uint8_t ret = RET_OK;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);

	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_CMD, cmd);

	if(qsfp28_get_cmd_status() == false)
	{
		uart_printf("%s","\r\nCmd failed");
		ret = RET_FAILED;
	}

	return ret;
}


uint8_t qsfp28_config_mod_console(bool enable)
{
	uint8_t SFRPAGE_SAVE = SFRPAGE, ret = RET_OK;
	uint8_t tmp = enable ? 1 : 0;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);

	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_READ_DATA0, tmp);
	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_CMD, DBG_SET_MOD_CONSOLE);

	if(enable)  //enable module uart func
	{
		if(qsfp28_get_cmd_status() == false)
		{
			uart_printf("%s","\r\nenable module uart failed");
			return RET_FAILED;
		}

		SFRPAGE = 0x0;
		P1MDOUT &= ~P1MDOUT_B5__PUSH_PULL ;

		SFRPAGE = 0x20;
		P2MDOUT &= ~P2MDOUT_B0__PUSH_PULL ;

		RESET  = 1;
		MODSEL = 1;

		SFRPAGE = SFRPAGE_SAVE;
	}
	else  //disable module uart func
	{
		SFRPAGE = 0x0;
		P1MDOUT |= P1MDOUT_B5__PUSH_PULL ;

		SFRPAGE = 0x20;
		P2MDOUT |= P2MDOUT_B0__PUSH_PULL ;

		RESET  = 1;
		MODSEL = 0;

		if(qsfp28_get_cmd_status() == false)
		{
			uart_printf("%s","\r\ndisable module uart failed");
			return RET_FAILED;
		}
	}

	SFRPAGE = SFRPAGE_SAVE;

	return ret;
}

uint8_t qsfp28_get_tec(SFP_PAGE page,uint8_t tec,uint16_t *Pdata)
{
	uint8_t datab[2];
	uint8_t ret = RET_OK;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, page);
	JUDGE_RETURN(ret);
	ret = i2c_master_read(I2C_DEVICE_ADDR,tec,datab,2);
	*Pdata = (uint16_t)((datab[0] << 8) & 0xff00)| datab[1];

	return ret;
}

RETURN_VALUE_TYPE LR4_301_set_tec_able(uint8_t enale)
{
	RETURN_VALUE_TYPE  ret = RET_OK;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);

	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_CMD, DBG_TEC_ENABLE_CMD);
	ret = i2c_master_write_byte(I2C_DEVICE_ADDR, SFP_DBG_READ_DATA0, enale);

	if(qsfp28_get_cmd_status() == false)
	{
		uart_printf("%s","\r\nenable module uart failed");
	}
	return ret;
}

RETURN_VALUE_TYPE  qsfp28_set_tec(SFP_PAGE page,uint8_t tec,uint16_t *Pdata)
{
	uint8_t ret = RET_OK;
	uint8_t datab[2] = {0};

	datab[0]= *Pdata >> 8;
	datab[1]= *Pdata;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, page);
	JUDGE_RETURN(ret);
	ret = smb_write_page_byte(I2C_DEVICE_ADDR, page, tec, datab, 2);
	return ret;
}

