paddy2008/c51_uboot/src/Efm8lb12_qsfp28.c
static uint8_t qsfp28_get_each_thrhld_value(MSA_PAGE3_ALARM_WARING_THRESHOLD_T type)
{
	uint16_t value16 = 0;
	uint8_t ret = RET_OK;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, MSA_PAGE_03H);
	JUDGE_RETURN(ret);

	ret = i2c_master_read(I2C_DEVICE_ADDR, page3_alarm_wran_select[type], (uint8_t *)&value16, 2);

	switch(type)
	{
		case TEMP_HIGH_ALARM:
		{
			uart_printf("\r\nthrhld_temp_high_alarm\t:%f(C)", ((float)(int16_t)value16)/(float)DDMI_CALI_TEMP_SCALE);
			break;
		}
		case TEMP_LOW_ALARM:
		{
			uart_printf("\r\nthrhld_temp_low_alarm\t:%f(C)", ((float)(int16_t)value16)/(float)DDMI_CALI_TEMP_SCALE);
			break;
		}
		case TEMP_HIGH_WARN:
		{
			uart_printf("\r\nthrhld_temp_high_warn\t:%f(C)", ((float)(int16_t)value16)/(float)DDMI_CALI_TEMP_SCALE);
			break;
		}
		case TEMP_LOW_WARN:
		{
			uart_printf("\r\nthrhld_temp_low_warn\t:%f(C)", ((float)(int16_t)value16)/(float)DDMI_CALI_TEMP_SCALE);
			break;
		}
		case VCC_HIGH_ALARM:    //vcc
		{
			uart_printf("\r\nthrhld_vcc_high_alarm\t:%f(V)", (float)(value16) * 0.1 / 1000.0);
			break;
		}
		case VCC_LOW_ALARM:
		{
			uart_printf("\r\nthrhld_vcc_low_alarm\t:%f(V)", (float)(value16) * 0.1 / 1000.0);
			break;
		}
		case VCC_HIGH_WARN:
		{
			uart_printf("\r\nthrhld_vcc_high_warn\t:%f(V)", (float)(value16) * 0.1 / 1000.0);
			break;
		}
		case VCC_LOW_WARN:
		{
			uart_printf("\r\nthrhld_vcc_low_warn\t:%f(V)", (float)(value16) * 0.1 / 1000.0);
			break;
		}
		case RXPWR_HIGH_ALARM: //rxpwr
		{
			uart_printf("\r\nthrhld_rxpwr_high_alarm\t:%f(dbm)", 10.0 *log10(((float)value16 * 0.1 /1000.0)));
			break;
		}
		case RXPWR_LOW_ALARM:
		{
			uart_printf("\r\nthrhld_rxpwr_low_alarm\t:%f(dbm)", 10.0 *log10(((float)value16 * 0.1 /1000.0)));
			break;
		}
		case RXPWR_HIGH_WARN:
		{
			uart_printf("\r\nthrhld_rxpwr_high_warn\t:%f(dbm)", 10.0 *log10(((float)value16 * 0.1 /1000.0)));
			break;
		}
		case RXPWR_LOW_WARN:
		{
			uart_printf("\r\nthrhld_rxpwr_low_warn\t:%f(dbm)", 10.0 *log10(((float)value16 * 0.1 /1000.0)));
			break;
		}
		case TXBIAS_HIGH_ALARM: //txbias
		{
			uart_printf("\r\nthrhld_txbias_high_alarm:%f(mA)", (float)value16 * 2.0 / 1000.0);
			break;
		}
		case TXBIAS_LOW_ALARM:
		{
			uart_printf("\r\nthrhld_txbias_low_alarm\t:%f(mA)", (float)value16 * 2.0 / 1000.0);
			break;
		}
		case TXBIAS_HIGH_WARN:
		{
			uart_printf("\r\nthrhld_txbias_high_warn\t:%f(mA)", (float)value16 * 2.0 / 1000.0);
			break;
		}
		case TXBIAS_LOW_WARN:
		{
			uart_printf("\r\nthrhld_txbias_low_warn\t:%f(mA)", (float)value16 * 2.0 / 1000.0);
			break;
		}
		case TXPWR_HIGH_ALARM:  //txpwr
		{
			uart_printf("\r\nthrhld_txpwr_high_alarm\t:%f(dbm)", 10.0 *log10(((float)value16 * 0.1 /1000.0)));
			break;
		}
		case TXPWR_LOW_ALARM:
		{
			uart_printf("\r\nthrhld_txpwr_low_alarm\t:%f(dbm)", 10.0 *log10(((float)value16 * 0.1 /1000.0)));
			break;
		}
		case TXPWR_HIGH_WARN:
		{
			uart_printf("\r\nthrhld_txpwr_high_warn\t:%f(dbm)", 10.0 *log10(((float)value16 * 0.1 /1000.0)));
			break;
		}
		case TXPWR_LOW_WARN:
		{
			uart_printf("\r\nthrhld_txpwr_low_warn\t:%f(dbm)", 10.0 *log10(((float)value16 * 0.1 /1000.0)));
			break;
		}
		default:
		{
			ret = RET_FAILED;
			break;
		}
	}

	return ret;
}

uint8_t qsfp28_set_thrhld_value(MSA_PAGE3_ALARM_WARING_THRESHOLD_T type, uint16_t value)
{
	uint8_t ret = RET_OK;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, MSA_PAGE_03H);
	JUDGE_RETURN(ret);
	ret = i2c_master_write(I2C_DEVICE_ADDR, page3_alarm_wran_select[type],(uint8_t *)&value, 2);

	return ret;
}

uint8_t qsfp28_get_thrhld_value(MSA_PAGE3_ALARM_WARING_THRESHOLD_T type)
{
	uint16_t value = 0;
	uint8_t i = 0, ret = RET_OK;

	if(type >= TEMP_HIGH_ALARM && type < HTRHLD_ALL)
	{
		ret = qsfp28_get_each_thrhld_value(type);
	}
	else if(type == HTRHLD_ALL)
	{
		for(i = TEMP_HIGH_ALARM; i < HTRHLD_ALL; i++)
		{
			ret = qsfp28_get_each_thrhld_value(i);
		}
	}
	else
	{
		ret = RET_FAILED;
	}

	return ret;
}

uint8_t qsfp28_get_module_class()
{
	uint8_t ret = RET_FAILED;
	uint8_t value = 0;

	ret = smb_read_page_byte(I2C_DEVICE_ADDR,SFP_PAGE_05H, MSA_MODULE_CLASS, &value, 1);
	JUDGE_RETURN(ret);
	uart_printf("\r\n module_class:%bu",value);
	return ret;
}

uint8_t qsfp28_set_module_class(uint8_t value)
{
	uint8_t ret = RET_FAILED;

	ret = smb_write_page_byte(I2C_DEVICE_ADDR,SFP_PAGE_05H, MSA_MODULE_CLASS, &value, 1);
	return ret;
}

uint8_t qsfp28_disable_module_poll()
{
	uint8_t ret = RET_FAILED;
	uint16_t value = 0;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);
	ret = i2c_master_read(I2C_DEVICE_ADDR,SFP_DDMI_ENABLE,(uint8_t *)&poll, 2);
	ret = i2c_master_write(I2C_DEVICE_ADDR,SFP_DDMI_ENABLE,(uint8_t *)&value, 0x2);

	return ret;
}

uint8_t qsfp28_enable_module_poll()
{
	uint8_t ret = RET_FAILED;

	ret = qsfp28_select_page(I2C_DEVICE_ADDR, SFP_PAGE_SELECT, SFP_PAGE_04H);
	JUDGE_RETURN(ret);
	ret = i2c_master_write(I2C_DEVICE_ADDR,SFP_DDMI_ENABLE, (uint8_t *)&poll, 0x2);

	return ret;
}

static uint8_t qsfp28_check_module_security_level(uint8_t page)
{
	uint8_t ret = RET_OK, value = 0xCC;  //don't write value = 0xFE and 0xFF, because 0xFF indicate fail and 0xFE indicate success

	if(page >= SFP_PAGE_04H && page < SFP_NONE_PAGE)
	{
		i2c_master_write_byte(I2C_DEVICE_ADDR,SFP_PAGE_SELECT, SFP_PAGE_04H);
		i2c_master_write(I2C_DEVICE_ADDR, SFP_MOD_SECUR_LEVEL_STATUS, (uint8_t *)&value, 0x1);

		value = 0x0;
		i2c_master_read(I2C_DEVICE_ADDR, SFP_MOD_SECUR_LEVEL_STATUS, (uint8_t *)&value, 0x1);

		if(value == 0xCC)  //Write OK indicate enter security lever
		{
			ret = RET_OK;
		}
		else
		{
			ret = RET_NO_PERMISSION;
		}
	}

	return ret;
}

uint8_t qsfp28_select_page(uint8_t BaseAddr,uint16_t OffsetAddr,uint8_t page)
{
	uint8_t ret = RET_OK;

	ret = qsfp28_check_module_security_level(page);
	JUDGE_RETURN(ret);
	ret = i2c_master_write_byte(BaseAddr,OffsetAddr, page);

	return ret;
}


